import shutil
import sys
import os
from PIL import Image, ImageDraw, ImageFont
from lib.randomio import RandomIO

# Создаем картинку 400x200 с белым фоном

# words = [
#     "любовь",
#     "мечта",
#     "пчела",
#     "цветок",
#     "трава",
#     "краска",
#     "гром",
#     "подарок",
#     "мотоцикл"
# ]

# words = [
#     "Озеро",
#     "Фонарь",
#     "Скорость",
#     "Блокнот",
#     "Прохлада",
#     "Музыка",
#     "Дорога",
#     "Камень",
#     "Ветер",
#     "Звезда"
# ]

# words = [
#     "Жеманный",
#     "Земледелец",
#     "Имярек",
#     "Наглушить",
#     "Погремушка",
#     "Распилить",
#     "Сопроводиловка",
#     "Усталый",
#     "Ханжеский",
#     "Чиновный"
# ]

# words = [
#     "Вразрез",
#     "Довольствие",
#     "Законодательство",
#     "Затвердевать",
#     "Изрыгать",
#     "Макаронник",
#     "Перебежать",
#     "Подивить",
#     "Позаимствоваться",
#     "Психастения"
# ]

words = [
    "Велогонки",
    "Заткнуть",
    "Осиный",
    "Отклеиться",
    "Отразить",
    "Очерет",
    "Седелка",
    "Сумасбродный",
    "Штопать",
    "Щипковый"
]

wordsdir="./wordsdir/"

try:
    shutil.rmtree(wordsdir)
except:
    pass

try:
    os.makedirs(wordsdir)
except:
    pass


for texti in words:
    RandomIO.pyllowDraw(texti, wordsdir)